# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя способами

stroka = input('Введите сторку 1:')
stroka = stroka.replace(' ', '-')
print(stroka)
