# Дан список чисел, отсортировать его по возрастанию без использования sort и sorted

spisok_cisel = []
spisok_cisel = (input())
qwe = tuple[(spisok_cisel)]
print(spisok_cisel)
print(tuple(spisok_cisel))
