# Вводится строка, вывести уникальные символы
#
# stroka = input("Enter stroky:")
# for x in set(stroka):
#     if stroka.count(x) == 1:
#         print(x)

# Вводится число, посчитать его факториал

# chislo = int(input("Enter chislo:"))
# factorial = 1
# for x in range(1, chislo+1):
#     factorial *=x
#     print(factorial)

#Составить программу дял вычисления среднего арифметического N произвольно вводимых чисел

# n = int(input("Enter chislo:"))
# s = 0
# for i in range(n):
#     s += 1
# print(s/n)
